<a href="https://colab.research.google.com/github/baharaaii/DBCourseInha/blob/main/Homework_Database.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
#Exercise 1 - Display the status of each student based on the credits they
#currently have

#I assume that I have a table named 'students' with columns 'ID', 'name',
#'dept_name', and 'tot_cred'

SELECT
    name,
    CASE
        WHEN tot_cred < 30 THEN 'Freshman'
        WHEN tot_cred BETWEEN 30 AND 59 THEN 'Sophomore'
        WHEN tot_cred BETWEEN 60 AND 89 THEN 'Junior'
        WHEN tot_cred BETWEEN 90 AND 119 THEN 'Senior'
        ELSE 'Graduated'
    END AS status
FROM
    students;

IndentationError: ignored

In [ ]:
#Exercise 2 - Find the number of students with each status

#I assume that I have a table named 'students' with columns 'ID', 'name',
#'dept_name', and 'tot_cred'

SELECT
    CASE
        WHEN tot_cred < 30 THEN 'Freshman'
        WHEN tot_cred BETWEEN 30 AND 59 THEN 'Sophomore'
        WHEN tot_cred BETWEEN 60 AND 89 THEN 'Junior'
        WHEN tot_cred BETWEEN 90 AND 119 THEN 'Senior'
        ELSE 'Graduated'
    END AS status,
    COUNT(*) AS student_count
FROM
    students
GROUP BY
    status;

In [ ]:
#Exercise 3.a - Calculating the GPA for each student who have take any
#courses in 2008, spring semester

#I assume that I have a table named 'students' and a table named 'courses'
#with columns 'student_id', 'grade', and 'credits'

SELECT
    s.name,
    SUM(c.grade * c.credits) / SUM(c.max_grade * c.credits) AS gpa
FROM
    students s
JOIN
    courses c ON s.ID = c.student_id
GROUP BY
    s.name;

In [3]:
#Exercise 3.b - Finding the number of students according to category based
#on GPA

#I assume that I have a table named 'students' and a table named 'courses'
#with columns 'student_id', 'grade', and 'credits'

SELECT
    CASE
        WHEN AVG(c.grade * c.credits / c.max_grade * c.credits) BETWEEN 3.75 AND 4.50 THEN 'A'
        WHEN AVG(c.grade * c.credits / c.max_grade * c.credits) BETWEEN 3.00 AND 3.75 THEN 'B'
        WHEN AVG(c.grade * c.credits / c.max_grade * c.credits) BETWEEN 2.00 AND 3.00 THEN 'C'
        WHEN AVG(c.grade * c.credits / c.max_grade * c.credits) BETWEEN 1.50 AND 2.00 THEN 'D'
        ELSE 'F'
    END AS category,
    COUNT(*) AS student_count
FROM
    students s
JOIN
    courses c ON s.ID = c.student_id
GROUP BY
    category;